RT-Thread/rt-thread/bsp/freescale/platform/devices/MK50D10/include/MK50D10_extension.h
/*
 * Constants & macros for individual ADC_PGA bitfields
 */

/*!
 * @name Register ADC_PGA, field PGAG[19:16] (RW)
 *
 * PGA gain = 2^(PGAG)
 *
 * Values:
 * - 0b0000 - 1
 * - 0b0001 - 2
 * - 0b0010 - 4
 * - 0b0011 - 8
 * - 0b0100 - 16
 * - 0b0101 - 32
 * - 0b0110 - 64
 * - 0b0111 - Reserved
 * - 0b1000 - Reserved
 * - 0b1001 - Reserved
 * - 0b1010 - Reserved
 * - 0b1011 - Reserved
 * - 0b1100 - Reserved
 * - 0b1101 - Reserved
 * - 0b1110 - Reserved
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGAG field. */
#define ADC_RD_PGA_PGAG(base) ((ADC_PGA_REG(base) & ADC_PGA_PGAG_MASK) >> ADC_PGA_PGAG_SHIFT)
#define ADC_BRD_PGA_PGAG(base) (ADC_RD_PGA_PGAG(base))

/*! @brief Set the PGAG field to a new value. */
#define ADC_WR_PGA_PGAG(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGAG_MASK, ADC_PGA_PGAG(value)))
#define ADC_BWR_PGA_PGAG(base, value) (ADC_WR_PGA_PGAG(base, value))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGALPb[20] (RW)
 *
 * Values:
 * - 0b0 - PGA runs in Low-Power mode.
 * - 0b1 - PGA runs in Normal Power mode.
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGALPb field. */
#define ADC_RD_PGA_PGALPb(base) ((ADC_PGA_REG(base) & ADC_PGA_PGALPb_MASK) >> ADC_PGA_PGALPb_SHIFT)
#define ADC_BRD_PGA_PGALPb(base) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGALPb_SHIFT))

/*! @brief Set the PGALPb field to a new value. */
#define ADC_WR_PGA_PGALPb(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGALPb_MASK, ADC_PGA_PGALPb(value)))
#define ADC_BWR_PGA_PGALPb(base, value) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGALPb_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGAEN[23] (RW)
 *
 * Values:
 * - 0b0 - PGA disabled.
 * - 0b1 - PGA enabled.
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGAEN field. */
#define ADC_RD_PGA_PGAEN(base) ((ADC_PGA_REG(base) & ADC_PGA_PGAEN_MASK) >> ADC_PGA_PGAEN_SHIFT)
#define ADC_BRD_PGA_PGAEN(base) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGAEN_SHIFT))

/*! @brief Set the PGAEN field to a new value. */
#define ADC_WR_PGA_PGAEN(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGAEN_MASK, ADC_PGA_PGAEN(value)))
#define ADC_BWR_PGA_PGAEN(base, value) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGAEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_CLMD - ADC Minus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLMD - ADC Minus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x0000000AU
 *
 * The Minus-Side General Calibration Value (CLMx) registers contain calibration
 * information that is generated by the calibration function. These registers
 * contain seven calibration values of varying widths: CLM0[5:0], CLM1[6:0],
 * CLM2[7:0], CLM3[8:0], CLM4[9:0], CLMS[5:0], and CLMD[5:0]. CLMx are automatically
 * set when the self-calibration sequence is done, that is, CAL is cleared. If
 * these registers are written by the user after calibration, the linearity error
 * specifications may not be met.
 */
/*!
 * @name Constants and macros for entire ADC_CLMD register
 */
/*@{*/
#define ADC_RD_CLMD(base)        (ADC_CLMD_REG(base))
#define ADC_WR_CLMD(base, value) (ADC_CLMD_REG(base) = (value))
#define ADC_RMW_CLMD(base, mask, value) (ADC_WR_CLMD(base, (ADC_RD_CLMD(base) & ~(mask)) | (value)))
#define ADC_SET_CLMD(base, value) (ADC_WR_CLMD(base, ADC_RD_CLMD(base) |  (value)))
#define ADC_CLR_CLMD(base, value) (ADC_WR_CLMD(base, ADC_RD_CLMD(base) & ~(value)))
#define ADC_TOG_CLMD(base, value) (ADC_WR_CLMD(base, ADC_RD_CLMD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLMD bitfields
 */

/*!
 * @name Register ADC_CLMD, field CLMD[5:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLMD_CLMD field. */
#define ADC_RD_CLMD_CLMD(base) ((ADC_CLMD_REG(base) & ADC_CLMD_CLMD_MASK) >> ADC_CLMD_CLMD_SHIFT)
#define ADC_BRD_CLMD_CLMD(base) (ADC_RD_CLMD_CLMD(base))

/*! @brief Set the CLMD field to a new value. */
#define ADC_WR_CLMD_CLMD(base, value) (ADC_RMW_CLMD(base, ADC_CLMD_CLMD_MASK, ADC_CLMD_CLMD(value)))
#define ADC_BWR_CLMD_CLMD(base, value) (ADC_WR_CLMD_CLMD(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLMS - ADC Minus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLMS - ADC Minus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000020U
 *
 * For more information, see CLMD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLMS register
 */
/*@{*/
#define ADC_RD_CLMS(base)        (ADC_CLMS_REG(base))
#define ADC_WR_CLMS(base, value) (ADC_CLMS_REG(base) = (value))
#define ADC_RMW_CLMS(base, mask, value) (ADC_WR_CLMS(base, (ADC_RD_CLMS(base) & ~(mask)) | (value)))
#define ADC_SET_CLMS(base, value) (ADC_WR_CLMS(base, ADC_RD_CLMS(base) |  (value)))
#define ADC_CLR_CLMS(base, value) (ADC_WR_CLMS(base, ADC_RD_CLMS(base) & ~(value)))
#define ADC_TOG_CLMS(base, value) (ADC_WR_CLMS(base, ADC_RD_CLMS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLMS bitfields
 */

/*!
 * @name Register ADC_CLMS, field CLMS[5:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLMS_CLMS field. */
#define ADC_RD_CLMS_CLMS(base) ((ADC_CLMS_REG(base) & ADC_CLMS_CLMS_MASK) >> ADC_CLMS_CLMS_SHIFT)
#define ADC_BRD_CLMS_CLMS(base) (ADC_RD_CLMS_CLMS(base))

/*! @brief Set the CLMS field to a new value. */
#define ADC_WR_CLMS_CLMS(base, value) (ADC_RMW_CLMS(base, ADC_CLMS_CLMS_MASK, ADC_CLMS_CLMS(value)))
#define ADC_BWR_CLMS_CLMS(base, value) (ADC_WR_CLMS_CLMS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLM4 - ADC Minus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLM4 - ADC Minus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000200U
 *
 * For more information, see CLMD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLM4 register
 */
/*@{*/
#define ADC_RD_CLM4(base)        (ADC_CLM4_REG(base))
#define ADC_WR_CLM4(base, value) (ADC_CLM4_REG(base) = (value))
#define ADC_RMW_CLM4(base, mask, value) (ADC_WR_CLM4(base, (ADC_RD_CLM4(base) & ~(mask)) | (value)))
#define ADC_SET_CLM4(base, value) (ADC_WR_CLM4(base, ADC_RD_CLM4(base) |  (value)))
#define ADC_CLR_CLM4(base, value) (ADC_WR_CLM4(base, ADC_RD_CLM4(base) & ~(value)))
#define ADC_TOG_CLM4(base, value) (ADC_WR_CLM4(base, ADC_RD_CLM4(base) ^  (value)))
/*@}*/

